{
    "daily_quotes": [
        {
            "id": "karma_1",
            "chapter": 2,
            "verse": 47,
            "category": "karma",
            "sanskrit": "कर्मण्येवाधिकारस्ते मा फलेषु कदाचन।\nमा कर्मफलहेतुर्भूर्मा ते सङ्गोऽस्त्वकर्मणि॥",
            "hindi": "कर्म करने में ही तुम्हारा अधिकार है, फलों में कभी नहीं। कर्म के फल का हेतु मत बनो, और अकर्म में भी तुम्हारी आसक्ति न हो।",
            "english": "You have the right to work only, but never to its fruits. Let not the fruits of action be your motive, nor let your attachment be to inaction.",
            "life_lesson": "Focus on doing your best without worrying about the results. Success comes from dedicated effort.",
            "modern_application": "Applicable in career growth, studies, and personal goals - focus on the process rather than outcomes.",
            "tags": ["work", "duty", "detachment", "motivation"]
        },
        {
            "id": "karma_2",
            "chapter": 3,
            "verse": 19,
            "category": "karma",
            "sanskrit": "तस्मादसक्तः सततं कार्यं कर्म समाचर।\nअसक्तो ह्याचरन्कर्म परमाप्नोति पूरुषः॥",
            "hindi": "इसलिए तू निरंतर आसक्ति रहित होकर सदा कर्तव्य कर्म का भलीभांति आचरण कर, क्योंकि आसक्ति रहित होकर कर्म करता हुआ मनुष्य परमात्मा को प्राप्त होता है।",
            "english": "Therefore, without being attached to the fruits of activities, one should act as a matter of duty, for by working without attachment one attains the Supreme.",
            "life_lesson": "Perform your duties without emotional attachment to achieve the highest purpose.",
            "modern_application": "Useful in professional life - do your job well without getting emotionally entangled in office politics or outcomes.",
            "tags": ["detachment", "duty", "purpose", "work-ethic"]
        },
        {
            "id": "karma_3",
            "chapter": 3,
            "verse": 8,
            "category": "karma",
            "sanskrit": "नियतं कुरु कर्म त्वं कर्म ज्यायो ह्यकर्मणः।\nशरीरयात्रापि च ते न प्रसिद्ध्येदकर्मणः॥",
            "hindi": "तू नियत कर्म कर, क्योंकि कर्म न करने से कर्म करना श्रेष्ठ है और कर्म न करने से तेरे शरीर का निर्वाह भी नहीं सिद्ध होगा।",
            "english": "Perform your prescribed duty, for doing so is better than not working. One cannot even maintain one's physical body without work.",
            "life_lesson": "Taking action is better than inaction. Even basic survival requires effort.",
            "modern_application": "Relevant for overcoming procrastination and maintaining work-life balance.",
            "tags": ["action", "discipline", "responsibility", "daily-routine"]
        },
        {
            "id": "karma_4",
            "chapter": 6,
            "verse": 17,
            "category": "karma",
            "sanskrit": "युक्ताहारविहारस्य युक्तचेष्टस्य कर्मसु।\nयुक्तस्वप्नावबोधस्य योगो भवति दुःखहा॥",
            "hindi": "जो खाने-पीने में, विहार करने में, कर्मों के करने में तथा सोने-जागने में युक्त आचरण वाला है, उसका दुःखों का नाश करने वाला योग सिद्ध होता है।",
            "english": "For one who is moderate in eating and recreation, balanced in work, and regulated in sleep, the practice of yoga destroys all sorrows.",
            "life_lesson": "Balance in all activities leads to a harmonious life.",
            "modern_application": "Essential for work-life balance and maintaining physical and mental health.",
            "tags": ["balance", "lifestyle", "health", "moderation"]
        },
        {
            "id": "karma_5",
            "chapter": 3,
            "verse": 21,
            "category": "karma",
            "sanskrit": "यद्यदाचरति श्रेष्ठस्तत्तदेवेतरो जनः।\nस यत्प्रमाणं कुरुते लोकस्तदनुवर्तते॥",
            "hindi": "श्रेष्ठ पुरुष जो-जो आचरण करता है, अन्य पुरुष भी वैसा-वैसा ही आचरण करते हैं। वह जो प्रमाण कर देता है, समस्त लोक उसके अनुसार चलता है।",
            "english": "Whatever action a great person performs, common people follow. And whatever standards they set by exemplary acts, all the world pursues.",
            "life_lesson": "Leaders must set good examples as their actions influence others.",
            "modern_application": "Important for leadership roles, parenting, and social influence.",
            "tags": ["leadership", "influence", "responsibility", "example"]
        },
        {
            "id": "karma_6",
            "chapter": 18,
            "verse": 48,
            "category": "karma",
            "sanskrit": "सहजं कर्म कौन्तेय सदोषमपि न त्यजेत्।\nसर्वारम्भा हि दोषेण धूमेनाग्निरिवावृताः॥",
            "hindi": "हे कौन्तेय! दोषयुक्त होने पर भी सहज कर्म को नहीं त्यागना चाहिए, क्योंकि धुएँ से अग्नि की तरह सभी कर्म किसी न किसी दोष से युक्त हैं।",
            "english": "One should not abandon duties born of one's nature, even if they are flawed, for all endeavors are covered by some fault, as fire is covered by smoke.",
            "life_lesson": "Accept imperfection in action rather than seeking perfect inaction.",
            "modern_application": "Helpful in overcoming perfectionism and analysis paralysis in work and personal projects.",
            "tags": ["acceptance", "imperfection", "action", "natural-ability"]
        },
        {
            "id": "karma_7",
            "chapter": 3,
            "verse": 4,
            "category": "karma",
            "sanskrit": "न कर्मणामनारम्भान्नैष्कर्म्यं पुरुषोऽश्नुते।\nन च संन्यसनादेव सिद्धिं समधिगच्छति॥",
            "hindi": "मनुष्य कर्मों का आरम्भ न करने से नैष्कर्म्य को नहीं प्राप्त होता और न केवल संन्यास से ही सिद्धि को प्राप्त होता है।",
            "english": "Not by abstaining from work can one achieve freedom from karma, nor by renunciation alone can one attain perfection.",
            "life_lesson": "True freedom comes through right action, not through avoiding action.",
            "modern_application": "Relevant for career development and personal growth - progress requires active engagement.",
            "tags": ["action", "growth", "engagement", "progress"]
        },
        {
            "id": "karma_8",
            "chapter": 18,
            "verse": 9,
            "category": "karma",
            "sanskrit": "कार्यमित्येव यत्कर्म नियतं क्रियतेऽर्जुन।\nसङ्गं त्यक्त्वा फलं चैव स त्यागः सात्त्विको मतः॥",
            "hindi": "हे अर्जुन! जो नियत कर्म 'करना ही है' ऐसा समझकर, आसक्ति और फल को त्यागकर किया जाता है, वही सात्त्विक त्याग माना गया है।",
            "english": "When prescribed duties are performed simply because they ought to be done, abandoning attachment and fruits, that renunciation is considered to be in the mode of goodness.",
            "life_lesson": "Do what needs to be done because it's right, not for rewards.",
            "modern_application": "Valuable for maintaining ethical standards in business and personal life.",
            "tags": ["ethics", "duty", "detachment", "righteousness"]
        },
        {
            "id": "karma_9",
            "chapter": 4,
            "verse": 18,
            "category": "karma",
            "sanskrit": "कर्मण्यकर्म यः पश्येदकर्मणि च कर्म यः।\nस बुद्धिमान्मनुष्येषु स युक्तः कृत्स्नकर्मकृत्॥",
            "hindi": "जो कर्म में अकर्म और अकर्म में कर्म देखता है, वह मनुष्यों में बुद्धिमान है और वह योगी समस्त कर्मों का करने वाला है।",
            "english": "One who sees inaction in action, and action in inaction, is intelligent among men, and they are in the transcendental position, although engaged in all sorts of activities.",
            "life_lesson": "True understanding comes from seeing the deeper nature of action and inaction.",
            "modern_application": "Helpful in understanding work-life balance and mindful action in daily life.",
            "tags": ["wisdom", "understanding", "mindfulness", "action"]
        },
        {
            "id": "karma_10",
            "chapter": 3,
            "verse": 27,
            "category": "karma",
            "sanskrit": "प्रकृतेः क्रियमाणानि गुणैः कर्माणि सर्वशः।\nअहङ्कारविमूढात्मा कर्ताहमिति मन्यते॥",
            "hindi": "प्रकृति के गुणों द्वारा सब प्रकार से कर्म किए जा रहे हैं, अहंकार से मोहित हुआ अज्ञानी 'मैं कर्ता हूँ' ऐसा मानता है।",
            "english": "The spirit soul bewildered by the influence of false ego thinks himself the doer of activities that are in actuality carried out by the three modes of material nature.",
            "life_lesson": "Stay humble and recognize that our abilities come from nature.",
            "modern_application": "Important for maintaining humility in success and understanding team achievements.",
            "tags": ["humility", "ego", "self-awareness", "nature"]
        },
        {
            "id": "resilience_1",
            "chapter": 2,
            "verse": 14,
            "category": "resilience",
            "sanskrit": "मात्रास्पर्शास्तु कौन्तेय शीतोष्णसुखदुःखदाः।\nआगमापायिनोऽनित्यास्तांस्तितिक्षस्व भारत॥",
            "hindi": "हे कुंतीपुत्र! सर्दी-गर्मी, सुख-दुःख देने वाले इन्द्रियों के संसर्ग तो आने-जाने वाले और अनित्य हैं, इसलिए हे भारत! उनको तू सहन कर।",
            "english": "O son of Kunti, the nonpermanent appearance of happiness and distress, and their disappearance in due course, are like the appearance and disappearance of winter and summer seasons.",
            "life_lesson": "Life's ups and downs are temporary. Stay balanced through good and bad times.",
            "modern_application": "Helpful during stressful work situations, relationship challenges, or financial difficulties.",
            "tags": ["patience", "endurance", "equanimity", "perspective"]
        },
        {
            "id": "resilience_2",
            "chapter": 2,
            "verse": 56,
            "category": "resilience",
            "sanskrit": "दुःखेष्वनुद्विग्नमनाः सुखेषु विगतस्पृहः।\nवीतरागभयक्रोधः स्थितधीर्मुनिरुच्यते॥",
            "hindi": "दुःखों में उद्विग्न न होने वाला, सुखों की स्पृहा से रहित और राग, भय तथा क्रोध से रहित जिसकी बुद्धि स्थिर है, वह मुनि स्थितप्रज्ञ कहा जाता है।",
            "english": "One who is not disturbed in mind even amidst the threefold miseries or elated when there is happiness, and who is free from attachment, fear and anger, is called a sage of steady mind.",
            "life_lesson": "True strength comes from maintaining mental equilibrium in all situations.",
            "modern_application": "Essential for leadership roles, crisis management, and personal stability.",
            "tags": ["mental-strength", "emotional-balance", "stability", "leadership"]
        },
        {
            "id": "resilience_3",
            "chapter": 2,
            "verse": 15,
            "category": "resilience",
            "sanskrit": "यं हि न व्यथयन्त्येते पुरुषं पुरुषर्षभ।\nसमदुःखसुखं धीरं सोऽमृतत्वाय कल्पते॥",
            "hindi": "हे पुरुषश्रेष्ठ! दुख-सुख को समान समझने वाले जिस धीर पुरुष को ये विकार व्याकुल नहीं करते, वह मोक्ष का अधिकारी होता है।",
            "english": "The wise one whom these do not disturb, who is unchanged in pain and pleasure, steady in both - is fit for liberation.",
            "life_lesson": "Equal acceptance of pleasure and pain leads to true freedom.",
            "modern_application": "Valuable during career setbacks, relationship challenges, or health issues.",
            "tags": ["equanimity", "acceptance", "mental-strength", "liberation"]
        },
        {
            "id": "resilience_4",
            "chapter": 2,
            "verse": 45,
            "category": "resilience",
            "sanskrit": "त्रैगुण्यविषया वेदा निस्त्रैगुण्यो भवार्जुन।\nनिर्द्वन्द्वो नित्यसत्त्वस्थो निर्योगक्षेम आत्मवान्॥",
            "hindi": "वेद त्रिगुणों का विषय है, तू त्रिगुणों से परे हो जा। द्वंद्वों से मुक्त हो, नित्य सत्त्वस्थ हो और योगक्षेम की चिंता से रहित होकर आत्मपरायण हो।",
            "english": "Rise above the three modes of material nature. Be free from dualities, be eternally situated in reality, and be free from all anxieties about gain and protection.",
            "life_lesson": "True resilience comes from rising above material concerns and staying focused on inner strength.",
            "modern_application": "Helpful in managing workplace stress and material pressures.",
            "tags": ["transcendence", "inner-strength", "focus", "stress-management"]
        },
        {
            "id": "resilience_5",
            "chapter": 6,
            "verse": 7,
            "category": "resilience",
            "sanskrit": "जितात्मनः प्रशान्तस्य परमात्मा समाहितः।\nशीतोष्णसुखदुःखेषु तथा मानापमानयोः॥",
            "hindi": "जिसने मन को जीत लिया है, जो शांत है, उस व्यक्ति में सर्दी-गर्मी, सुख-दुःख तथा मान-अपमान में परमात्मा समभाव से स्थित रहता है।",
            "english": "For one who has conquered the mind, it remains calm in heat and cold, in pleasure and pain, and in honor and dishonor.",
            "life_lesson": "Mental mastery leads to unshakeable peace in all circumstances.",
            "modern_application": "Essential for maintaining composure during public speaking, interviews, or challenging situations.",
            "tags": ["mental-control", "composure", "balance", "inner-peace"]
        },
        {
            "id": "resilience_6",
            "chapter": 12,
            "verse": 18,
            "category": "resilience",
            "sanskrit": "समः शत्रौ च मित्रे च तथा मानापमानयोः।\nशीतोष्णसुखदुःखेषु समः सङ्गविवर्जितः॥",
            "hindi": "जो शत्रु और मित्र में, मान और अपमान में समान है तथा सर्दी-गर्मी और सुख-दुःख में सम है और आसक्ति से रहित है।",
            "english": "One who is equal to friends and enemies, who is equipoised in honor and dishonor, heat and cold, happiness and distress, and who is free from all attachment.",
            "life_lesson": "True strength lies in maintaining equilibrium in all situations.",
            "modern_application": "Useful in conflict resolution, team management, and personal relationships.",
            "tags": ["equanimity", "detachment", "balance", "relationships"]
        },
        {
            "id": "resilience_7",
            "chapter": 2,
            "verse": 38,
            "category": "resilience",
            "sanskrit": "सुखदुःखे समे कृत्वा लाभालाभौ जयाजयौ।\nततो युद्धाय युज्यस्व नैवं पापमवाप्स्यसि॥",
            "hindi": "सुख-दुःख, लाभ-हानि और जय-पराजय को समान समझकर युद्ध के लिए तैयार हो जा। इस प्रकार तू पाप को नहीं प्राप्त होगा।",
            "english": "Fight for the sake of duty, treating alike happiness and distress, loss and gain, victory and defeat. Fulfilling your responsibility in this way, you will never incur sin.",
            "life_lesson": "Face life's challenges with equanimity, focusing on duty rather than outcomes.",
            "modern_application": "Important for business decisions, competitive situations, and personal challenges.",
            "tags": ["duty", "equanimity", "responsibility", "action"]
        },
        {
            "id": "resilience_8",
            "chapter": 2,
            "verse": 70,
            "category": "resilience",
            "sanskrit": "आपूर्यमाणमचलप्रतिष्ठं समुद्रमापः प्रविशन्ति यद्वत्।\nतद्वत्कामा यं प्रविशन्ति सर्वे स शान्तिमाप्नोति न कामकामी॥",
            "hindi": "जैसे सब ओर से भरे हुए अचल प्रतिष्ठावाले समुद्र में जल समा जाता है, वैसे ही जिस धीर पुरुष में सब भोग विलीन हो जाते हैं, वही शांति प्राप्त करता है, न कि भोगों की कामना करने वाला।",
            "english": "A person who is not disturbed by the incessant flow of desires - like the ocean which is always being filled by waters but remains unmoved - can alone achieve peace, not the person who strives to satisfy such desires.",
            "life_lesson": "True peace comes from being undisturbed by desires, like an ocean unmoved by rivers flowing into it.",
            "modern_application": "Helpful in managing consumer culture, social media pressures, and material desires.",
            "tags": ["peace", "desires", "contentment", "stability"]
        },
        {
            "id": "resilience_9",
            "chapter": 4,
            "verse": 22,
            "category": "resilience",
            "sanskrit": "यदृच्छालाभसन्तुष्टो द्वन्द्वातीतो विमत्सरः।\nसमः सिद्धावसिद्धौ च कृत्वापि न निबध्यते॥",
            "hindi": "जो स्वतः प्राप्त लाभ में संतुष्ट है, द्वंद्वों से परे है, मत्सररहित है तथा सिद्धि और असिद्धि में समान है, वह कर्म करता हुआ भी बंधनों में नहीं बंधता।",
            "english": "Content with whatever comes of its own accord, transcending dualities, free from envy, and balanced in success and failure, though engaged in work, they are never bound.",
            "life_lesson": "Contentment and acceptance lead to freedom from life's bondages.",
            "modern_application": "Essential for maintaining work-life balance and professional satisfaction.",
            "tags": ["contentment", "freedom", "acceptance", "balance"]
        },
        {
            "id": "resilience_10",
            "chapter": 6,
            "verse": 32,
            "category": "resilience",
            "sanskrit": "आत्मौपम्येन सर्वत्र समं पश्यति योऽर्जुन।\nसुखं वा यदि वा दुःखं स योगी परमो मतः॥",
            "hindi": "हे अर्जुन! जो सबको अपने समान देखता है, चाहे सुख हो या दुःख, वह योगी श्रेष्ठ माना गया है।",
            "english": "The highest yogi is one who feels the pain and pleasure of others as if they were their own.",
            "life_lesson": "True resilience includes empathy and understanding others' experiences.",
            "modern_application": "Important for leadership, counseling, and building strong relationships.",
            "tags": ["empathy", "understanding", "connection", "compassion"]
        },
        {
            "id": "self_improvement_1",
            "chapter": 6,
            "verse": 5,
            "category": "self_improvement",
            "sanskrit": "उद्धरेदात्मनात्मानं नात्मानमवसादयेत्।\nआत्मैव ह्यात्मनो बन्धुरात्मैव रिपुरात्मनः॥",
            "hindi": "मनुष्य को चाहिए कि अपने द्वारा अपना उद्धार करे और अपना पतन न करे, क्योंकि आत्मा ही अपना मित्र है और आत्मा ही अपना शत्रु है।",
            "english": "Elevate yourself through the power of your mind, and not degrade yourself, for the mind can be both friend and enemy of the self.",
            "life_lesson": "Self-improvement starts with mastering your own mind.",
            "modern_application": "Crucial for personal development, mental health, and achieving goals.",
            "tags": ["self-help", "mental-strength", "personal-growth", "mindset"]
        },
        {
            "id": "self_improvement_2",
            "chapter": 3,
            "verse": 43,
            "category": "self_improvement",
            "sanskrit": "एवं बुद्धेः परं बुद्ध्वा संस्तभ्यात्मानमात्मना।\nजहि शत्रुं महाबाहो कामरूपं दुरासदम्॥",
            "hindi": "इस प्रकार बुद्धि से परे आत्मा को जानकर, अपने आप को अपने द्वारा स्थिर करके, हे महाबाहो! इस कामरूपी दुर्जय शत्रु का नाश कर।",
            "english": "Thus knowing oneself to be transcendental to the material senses, mind and intelligence, O mighty-armed Arjuna, one should control the lower self by the higher self and thus—by spiritual strength—conquer this insatiable enemy known as lust.",
            "life_lesson": "Master your desires through self-awareness and spiritual strength.",
            "modern_application": "Helpful in managing impulse buying, social media addiction, and instant gratification tendencies.",
            "tags": ["self-control", "awareness", "discipline", "mastery"]
        },
        {
            "id": "self_improvement_3",
            "chapter": 6,
            "verse": 26,
            "category": "self_improvement",
            "sanskrit": "यतो यतो निश्चरति मनश्चञ्चलमस्थिरम्।\nततस्ततो नियम्यैतदात्मन्येव वशं नयेत्॥",
            "hindi": "यह चंचल और अस्थिर मन जिस-जिस विषय में विचरण करे, उस-उस से रोककर इसको आत्मा में ही नियंत्रित करे।",
            "english": "From wherever the mind wanders due to its flickering and unsteady nature, one must certainly withdraw it and bring it back under the control of the Self.",
            "life_lesson": "Constant practice of mind control leads to self-mastery.",
            "modern_application": "Essential for meditation, focus at work, and avoiding digital distractions.",
            "tags": ["focus", "mind-control", "meditation", "concentration"]
        },
        {
            "id": "self_improvement_4",
            "chapter": 4,
            "verse": 38,
            "category": "self_improvement",
            "sanskrit": "न हि ज्ञानेन सदृशं पवित्रमिह विद्यते।\nतत्स्वयं योगसंसिद्धः कालेनात्मनि विन्दति॥",
            "hindi": "इस संसार में ज्ञान के समान पवित्र करने वाला निःसंदेह कुछ भी नहीं है। उस ज्ञान को योग में सिद्ध हुआ मनुष्य कालक्रम से स्वयं अपने आप में पा लेता है।",
            "english": "In this world, there is nothing so sublime and pure as transcendental knowledge. One who has attained purity through yoga finds this knowledge within himself in due course of time.",
            "life_lesson": "True knowledge comes through persistent self-improvement and inner purification.",
            "modern_application": "Important for continuous learning, skill development, and personal growth.",
            "tags": ["knowledge", "growth", "learning", "self-discovery"]
        },
        {
            "id": "self_improvement_5",
            "chapter": 13,
            "verse": 8,
            "category": "self_improvement",
            "sanskrit": "अमानित्वमदम्भित्वमहिंसा क्षान्तिरार्जवम्।\nआचार्योपासनं शौचं स्थैर्यमात्मविनिग्रहः॥",
            "hindi": "अमानित्व, अदम्भित्व, अहिंसा, क्षमा, सरलता, आचार्य की सेवा, पवित्रता, स्थिरता और आत्मसंयम [ये सब ज्ञान हैं]।",
            "english": "Humility, pridelessness, nonviolence, tolerance, simplicity, approaching a genuine spiritual master, cleanliness, steadiness and self-control.",
            "life_lesson": "Develop noble qualities for genuine self-improvement.",
            "modern_application": "Valuable for leadership development, professional ethics, and personal character building.",
            "tags": ["character", "virtues", "ethics", "self-control"]
        },
        {
            "id": "self_improvement_6",
            "chapter": 18,
            "verse": 37,
            "category": "self_improvement",
            "sanskrit": "यत्तदग्रे विषमिव परिणामेऽमृतोपमम्।\nतत्सुखं सात्त्विकं प्रोक्तं आत्मबुद्धिप्रसादजम्॥",
            "hindi": "जो आरम्भ में विष के समान लगता है परन्तु परिणाम में अमृत के समान होता है, वह सुख सात्त्विक कहा गया है, जो आत्मबुद्धि के प्रसाद से उत्पन्न होता है।",
            "english": "That which in the beginning may be like poison but at the end is like nectar - that happiness is said to be in the mode of goodness, born of the satisfaction of the self.",
            "life_lesson": "True growth often requires initial discomfort but leads to lasting satisfaction.",
            "modern_application": "Relevant for fitness goals, learning new skills, and breaking bad habits.",
            "tags": ["growth", "persistence", "transformation", "satisfaction"]
        },
        {
            "id": "self_improvement_7",
            "chapter": 2,
            "verse": 62,
            "category": "self_improvement",
            "sanskrit": "ध्यायतो विषयान्पुंसः सङ्गस्तेषूपजायते।\nसङ्गात्सञ्जायते कामः कामात्क्रोधोऽभिजायते॥",
            "hindi": "विषयों का चिंतन करने से उनमें आसक्ति होती है, आसक्ति से काम उत्पन्न होता है और काम से क्रोध उत्पन्न होता है।",
            "english": "While contemplating the objects of the senses, a person develops attachment for them, and from such attachment lust develops, and from lust anger arises.",
            "life_lesson": "Understanding and breaking negative thought patterns is key to self-improvement.",
            "modern_application": "Useful for managing social media usage, consumer behavior, and emotional reactions.",
            "tags": ["mindfulness", "emotional-control", "awareness", "habits"]
        },
        {
            "id": "self_improvement_8",
            "chapter": 6,
            "verse": 35,
            "category": "self_improvement",
            "sanskrit": "असंशयं महाबाहो मनो दुर्निग्रहं चलम्।\nअभ्यासेन तु कौन्तेय वैराग्येण च गृह्यते॥",
            "hindi": "निःसंदेह मन चंचल और वश में करना कठिन है, परन्तु हे कुन्तीपुत्र! अभ्यास और वैराग्य से इसे वश में किया जा सकता है।",
            "english": "Undoubtedly, O mighty-armed one, the mind is difficult to curb and is restless, but it can be controlled through practice and detachment.",
            "life_lesson": "Consistent practice and detachment are key to mastering the mind.",
            "modern_application": "Essential for developing new habits, meditation practice, and focus improvement.",
            "tags": ["practice", "detachment", "mental-control", "habits"]
        },
        {
            "id": "self_improvement_9",
            "chapter": 14,
            "verse": 11,
            "category": "self_improvement",
            "sanskrit": "सर्वद्वारेषु देहेऽस्मिन्प्रकाश उपजायते।\nज्ञानं यदा तदा विद्याद्विवृद्धं सत्त्वमित्युत॥",
            "hindi": "जब इस देह के सभी द्वारों में ज्ञान का प्रकाश होता है, तब सत्वगुण को बढ़ा हुआ जानना चाहिए।",
            "english": "When enlightenment illumines all the gates of the body, then it should be known that goodness has become predominant.",
            "life_lesson": "True self-improvement leads to all-round enlightenment and clarity.",
            "modern_application": "Important for holistic development, work-life balance, and mental clarity.",
            "tags": ["enlightenment", "clarity", "awareness", "balance"]
        },
        {
            "id": "self_improvement_10",
            "chapter": 16,
            "verse": 1,
            "category": "self_improvement",
            "sanskrit": "अभयं सत्त्वसंशुद्धिर्ज्ञानयोगव्यवस्थितिः।\nदानं दमश्च यज्ञश्च स्वाध्यायस्तप आर्जवम्॥",
            "hindi": "अभय, अन्तःकरण की शुद्धि, ज्ञानयोग में दृढ़ स्थिति, दान, इन्द्रियों का दमन, यज्ञ, स्वाध्याय, तप और सरलता।",
            "english": "Fearlessness, purification of one's existence, cultivation of spiritual knowledge, charity, self-control, sacrifice, study of the scriptures, austerity, and simplicity.",
            "life_lesson": "Develop divine qualities systematically for complete self-transformation.",
            "modern_application": "Valuable for personal development, leadership qualities, and spiritual growth.",
            "tags": ["divine-qualities", "transformation", "character", "spirituality"]
        }
    ]
}
        